fedddot/esp32_wifi2iic/sdkconfig.defaults
#
# Serial flasher config
#
# default:
# CONFIG_ESPTOOLPY_NO_STUB is not set
# default:
# CONFIG_ESPTOOLPY_FLASHMODE_QIO is not set
# default:
# CONFIG_ESPTOOLPY_FLASHMODE_QOUT is not set
# default:
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
# default:
# CONFIG_ESPTOOLPY_FLASHMODE_DOUT is not set
# default:
CONFIG_ESPTOOLPY_FLASH_SAMPLE_MODE_STR=y
# default:
CONFIG_ESPTOOLPY_FLASHMODE="dio"
# default:
CONFIG_ESPTOOLPY_FLASHMODE_VAL=3
# default:
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
# default:
# CONFIG_ESPTOOLPY_FLASHFREQ_40M is not set
# default:
# CONFIG_ESPTOOLPY_FLASHFREQ_26M is not set
# default:
# CONFIG_ESPTOOLPY_FLASHFREQ_20M is not set
# default:
CONFIG_ESPTOOLPY_FLASHFREQ="80m"
# default:
# CONFIG_ESPTOOLPY_FLASHSIZE_1MB is not set
# default:
CONFIG_ESPTOOLPY_FLASHSIZE_2MB=y
# default:
# CONFIG_ESPTOOLPY_FLASHSIZE_4MB is not set
# default:
# CONFIG_ESPTOOLPY_FLASHSIZE_8MB is not set
# default:
# CONFIG_ESPTOOLPY_FLASHSIZE_16MB is not set
# default:
# CONFIG_ESPTOOLPY_FLASHSIZE_32MB is not set
# default:
# CONFIG_ESPTOOLPY_FLASHSIZE_64MB is not set
# default:
# CONFIG_ESPTOOLPY_FLASHSIZE_128MB is not set
# default:
CONFIG_ESPTOOLPY_FLASHSIZE="2MB"
# default:
# CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE is not set
# default:
CONFIG_ESPTOOLPY_BEFORE_RESET=y
# default:
# CONFIG_ESPTOOLPY_BEFORE_NORESET is not set
# default:
CONFIG_ESPTOOLPY_BEFORE="default-reset"
# default:
CONFIG_ESPTOOLPY_AFTER_RESET=y
# default:
# CONFIG_ESPTOOLPY_AFTER_NORESET is not set
# default:
CONFIG_ESPTOOLPY_AFTER="hard-reset"
# default:
CONFIG_ESPTOOLPY_MONITOR_BAUD=115200
# end of Serial flasher config

#
# Partition Table
#
# default:
CONFIG_PARTITION_TABLE_SINGLE_APP=y
# default:
# CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE is not set
# default:
# CONFIG_PARTITION_TABLE_TWO_OTA is not set
# default:
# CONFIG_PARTITION_TABLE_TWO_OTA_LARGE is not set
# default:
# CONFIG_PARTITION_TABLE_CUSTOM is not set
# default:
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
# default:
CONFIG_PARTITION_TABLE_FILENAME="partitions_singleapp.csv"
# default:
CONFIG_PARTITION_TABLE_OFFSET=0x8000
# default:
CONFIG_PARTITION_TABLE_MD5=y
# end of Partition Table

#
# Compiler options
#
# default:
CONFIG_COMPILER_OPTIMIZATION_DEBUG=y
# default:
# CONFIG_COMPILER_OPTIMIZATION_SIZE is not set
# default:
# CONFIG_COMPILER_OPTIMIZATION_PERF is not set
# default:
# CONFIG_COMPILER_OPTIMIZATION_NONE is not set
# default:
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE=y
# default:
# CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT is not set
# default:
# CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE is not set
# default:
# CONFIG_COMPILER_ASSERT_NDEBUG_EVALUATE is not set
# default:
CONFIG_COMPILER_FLOAT_LIB_FROM_GCCLIB=y
# default:
CONFIG_COMPILER_OPTIMIZATION_ASSERTION_LEVEL=2
# default:
# CONFIG_COMPILER_OPTIMIZATION_CHECKS_SILENT is not set
# default:
CONFIG_COMPILER_HIDE_PATHS_MACROS=y
# default:
CONFIG_COMPILER_CXX_EXCEPTIONS=y
# default:
CONFIG_COMPILER_CXX_RTTI=y
# default:
CONFIG_COMPILER_STACK_CHECK_MODE_NONE=y
# default:
# CONFIG_COMPILER_STACK_CHECK_MODE_NORM is not set
# default:
# CONFIG_COMPILER_STACK_CHECK_MODE_STRONG is not set
# default:
# CONFIG_COMPILER_STACK_CHECK_MODE_ALL is not set
# default:
# CONFIG_COMPILER_NO_MERGE_CONSTANTS is not set
# default:
# CONFIG_COMPILER_WARN_WRITE_STRINGS is not set
# default:
# CONFIG_COMPILER_DISABLE_DEFAULT_ERRORS is not set
# default:
# CONFIG_COMPILER_DISABLE_GCC12_WARNINGS is not set
# default:
# CONFIG_COMPILER_DISABLE_GCC13_WARNINGS is not set
# default:
# CONFIG_COMPILER_DISABLE_GCC14_WARNINGS is not set
# default:
# CONFIG_COMPILER_DISABLE_GCC15_WARNINGS is not set
# default:
# CONFIG_COMPILER_DUMP_RTL_FILES is not set
# default:
CONFIG_COMPILER_RT_LIB_GCCLIB=y
# default:
CONFIG_COMPILER_RT_LIB_NAME="gcc"
# default:
CONFIG_COMPILER_ORPHAN_SECTIONS_ERROR=y
# default:
# CONFIG_COMPILER_ORPHAN_SECTIONS_WARNING is not set
# default:
# CONFIG_COMPILER_ORPHAN_SECTIONS_PLACE is not set
# default:
# CONFIG_COMPILER_STATIC_ANALYZER is not set
# default:
CONFIG_COMPILER_CXX_GLIBCXX_CONSTEXPR_NO_CHANGE=y
# default:
# CONFIG_COMPILER_CXX_GLIBCXX_CONSTEXPR_COLD_CONSTEXPR is not set
# default:
# CONFIG_COMPILER_CXX_GLIBCXX_CONSTEXPR_COLD is not set
# end of Compiler options

#
# Component config
#

#
# !!! MINIMAL_BUILD is enabled !!!
#

#
# Only common components and those transitively required by the main component are listed
#

#
# If a component configuration is missing, please add it to the main component's requirements
#

#
# Console Library
#
# default:
# CONFIG_CONSOLE_SORTED_HELP is not set
# end of Console Library

#
# eFuse Bit Manager
#
# default:
# CONFIG_EFUSE_CUSTOM_TABLE is not set
# default:
# CONFIG_EFUSE_VIRTUAL is not set
# default:
CONFIG_EFUSE_MAX_BLK_LEN=256
# end of eFuse Bit Manager

#
# ESP-TLS
#
# default:
CONFIG_ESP_TLS_USING_MBEDTLS=y
# default:
# CONFIG_ESP_TLS_CUSTOM_STACK is not set
# default:
# CONFIG_ESP_TLS_USE_SECURE_ELEMENT is not set
# default:
CONFIG_ESP_TLS_USE_DS_PERIPHERAL=y
# default:
# CONFIG_ESP_TLS_CLIENT_SESSION_TICKETS is not set
# default:
# CONFIG_ESP_TLS_SERVER_SESSION_TICKETS is not set
# default:
# CONFIG_ESP_TLS_SERVER_CERT_SELECT_HOOK is not set
# default:
# CONFIG_ESP_TLS_SERVER_MIN_AUTH_MODE_OPTIONAL is not set
# default:
# CONFIG_ESP_TLS_PSK_VERIFICATION is not set
# default:
# CONFIG_ESP_TLS_INSECURE is not set
# default:
CONFIG_ESP_TLS_DYN_BUF_STRATEGY_SUPPORTED=y
# end of ESP-TLS

#
# Wireless Coexistence
#
# default:
CONFIG_ESP_COEX_ENABLED=y
# default:
# CONFIG_ESP_COEX_EXTERNAL_COEXIST_ENABLE is not set
# default:
# CONFIG_ESP_COEX_GPIO_DEBUG is not set
# end of Wireless Coexistence

#
# Common ESP-related
#
# default:
CONFIG_ESP_ERR_TO_NAME_LOOKUP=y
# end of Common ESP-related

#
# ESP-Driver:GPIO Configurations
#
# default:
# CONFIG_GPIO_CTRL_FUNC_IN_IRAM is not set
# end of ESP-Driver:GPIO Configurations

#
# ESP-Driver:UART Configurations
#
# default:
# CONFIG_UART_ISR_IN_IRAM is not set
# end of ESP-Driver:UART Configurations

#
# ESP-Driver:UHCI Configurations
#
# default:
# CONFIG_UHCI_ISR_HANDLER_IN_IRAM is not set
# default:
# CONFIG_UHCI_ISR_CACHE_SAFE is not set
# default:
# CONFIG_UHCI_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:UHCI Configurations

#
# Event Loop Library
#
# default:
# CONFIG_ESP_EVENT_LOOP_PROFILING is not set
# default:
CONFIG_ESP_EVENT_POST_FROM_ISR=y
# default:
CONFIG_ESP_EVENT_POST_FROM_ISR_SIZE=4
# default:
CONFIG_ESP_EVENT_POST_FROM_IRAM_ISR=y
# end of Event Loop Library

#
# HTTP Server
#
# default:
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
# default:
CONFIG_HTTPD_MAX_URI_LEN=512
# default:
CONFIG_HTTPD_ERR_RESP_NO_DELAY=y
# default:
CONFIG_HTTPD_PURGE_BUF_LEN=32
# default:
# CONFIG_HTTPD_LOG_PURGE_DATA is not set
# default:
# CONFIG_HTTPD_WS_SUPPORT is not set
# default:
# CONFIG_HTTPD_QUEUE_WORK_BLOCKING is not set
# default:
CONFIG_HTTPD_ENABLE_EVENTS=y
# default:
CONFIG_HTTPD_SERVER_EVENT_POST_TIMEOUT=2000
# end of HTTP Server

#
# Hardware Settings
#
# default:
CONFIG_ESP_HW_SUPPORT_FUNC_IN_IRAM=y

#
# Chip revision
#
# default:
CONFIG_ESP32S2_REV_MIN_0=y
# default:
# CONFIG_ESP32S2_REV_MIN_1 is not set
# default:
CONFIG_ESP32S2_REV_MIN_FULL=0
# default:
CONFIG_ESP_REV_MIN_FULL=0

#
# Maximum Supported ESP32-S2 Revision (Rev v1.99)
#
# default:
CONFIG_ESP32S2_REV_MAX_FULL=199
# default:
CONFIG_ESP_REV_MAX_FULL=199
# default:
CONFIG_ESP_EFUSE_BLOCK_REV_MIN_FULL=0
# default:
CONFIG_ESP_EFUSE_BLOCK_REV_MAX_FULL=99

#
# Maximum Supported ESP32-S2 eFuse Block Revision (eFuse Block Rev v0.99)
#
# end of Chip revision

#
# MAC Config
#
# default:
CONFIG_ESP_MAC_ADDR_UNIVERSE_WIFI_STA=y
# default:
CONFIG_ESP_MAC_ADDR_UNIVERSE_WIFI_AP=y
# default:
CONFIG_ESP_MAC_UNIVERSAL_MAC_ADDRESSES_TWO=y
# default:
CONFIG_ESP_MAC_UNIVERSAL_MAC_ADDRESSES=2
# default:
# CONFIG_ESP32S2_UNIVERSAL_MAC_ADDRESSES_ONE is not set
# default:
CONFIG_ESP32S2_UNIVERSAL_MAC_ADDRESSES_TWO=y
# default:
CONFIG_ESP32S2_UNIVERSAL_MAC_ADDRESSES=2
# default:
# CONFIG_ESP_MAC_USE_CUSTOM_MAC_AS_BASE_MAC is not set
# end of MAC Config

#
# Sleep Config
#
# default:
# CONFIG_ESP_SLEEP_POWER_DOWN_FLASH is not set
# default:
CONFIG_ESP_SLEEP_FLASH_LEAKAGE_WORKAROUND=y
# default:
# CONFIG_ESP_SLEEP_MSPI_NEED_ALL_IO_PU is not set
# default:
CONFIG_ESP_SLEEP_RTC_BUS_ISO_WORKAROUND=y
# default:
# CONFIG_ESP_SLEEP_GPIO_RESET_WORKAROUND is not set
# default:
CONFIG_ESP_SLEEP_WAIT_FLASH_READY_EXTRA_DELAY=0
# default:
# CONFIG_ESP_SLEEP_CACHE_SAFE_ASSERTION is not set
# default:
# CONFIG_ESP_SLEEP_DEBUG is not set
# default:
CONFIG_ESP_SLEEP_GPIO_ENABLE_INTERNAL_RESISTORS=y
# default:
# CONFIG_ESP_SLEEP_SET_FLASH_DPD is not set
# end of Sleep Config

#
# RTC Clock Config
#
# default:
CONFIG_RTC_CLK_SRC_INT_RC=y
# default:
# CONFIG_RTC_CLK_SRC_EXT_CRYS is not set
# default:
# CONFIG_RTC_CLK_SRC_EXT_OSC is not set
# default:
# CONFIG_RTC_CLK_SRC_INT_8MD256 is not set
# default:
CONFIG_RTC_CLK_CAL_CYCLES=576
# default:
CONFIG_RTC_CLK_FUNC_IN_IRAM=y
# default:
CONFIG_RTC_TIME_FUNC_IN_IRAM=y
# end of RTC Clock Config

#
# Peripheral Control
#
# default:
CONFIG_ESP_PERIPH_CTRL_FUNC_IN_IRAM=y
# default:
CONFIG_ESP_REGI2C_CTRL_FUNC_IN_IRAM=y
# end of Peripheral Control

#
# Main XTAL Config
#
# default:
CONFIG_XTAL_FREQ_40=y
# default:
CONFIG_XTAL_FREQ=40
# end of Main XTAL Config

#
# Power Supplier
#

#
# Brownout Detector
#
# default:
CONFIG_ESP_BROWNOUT_DET=y
# default:
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_7=y
# default:
# CONFIG_ESP_BROWNOUT_DET_LVL_SEL_6 is not set
# default:
# CONFIG_ESP_BROWNOUT_DET_LVL_SEL_5 is not set
# default:
# CONFIG_ESP_BROWNOUT_DET_LVL_SEL_4 is not set
# default:
# CONFIG_ESP_BROWNOUT_DET_LVL_SEL_3 is not set
# default:
# CONFIG_ESP_BROWNOUT_DET_LVL_SEL_2 is not set
# default:
# CONFIG_ESP_BROWNOUT_DET_LVL_SEL_1 is not set
# default:
CONFIG_ESP_BROWNOUT_DET_LVL=7
# default:
CONFIG_ESP_BROWNOUT_USE_INTR=y
# end of Brownout Detector
# end of Power Supplier

# default:
CONFIG_ESP_INTR_IN_IRAM=y
# end of Hardware Settings

#
# LibC
#
# default:
# CONFIG_LIBC_NEWLIB is not set
# default:
CONFIG_LIBC_PICOLIBC=y
# default:
CONFIG_LIBC_PICOLIBC_NEWLIB_COMPATIBILITY=y
# default:
CONFIG_LIBC_MISC_IN_IRAM=y
# default:
CONFIG_LIBC_LOCKS_PLACE_IN_IRAM=y
# default:
CONFIG_LIBC_STDOUT_LINE_ENDING_CRLF=y
# default:
# CONFIG_LIBC_STDOUT_LINE_ENDING_LF is not set
# default:
# CONFIG_LIBC_STDOUT_LINE_ENDING_CR is not set
# default:
# CONFIG_LIBC_STDIN_LINE_ENDING_CRLF is not set
# default:
# CONFIG_LIBC_STDIN_LINE_ENDING_LF is not set
# default:
CONFIG_LIBC_STDIN_LINE_ENDING_CR=y
# default:
CONFIG_LIBC_TIME_SYSCALL_USE_RTC_HRT=y
# default:
# CONFIG_LIBC_TIME_SYSCALL_USE_RTC is not set
# default:
# CONFIG_LIBC_TIME_SYSCALL_USE_HRT is not set
# default:
# CONFIG_LIBC_TIME_SYSCALL_USE_NONE is not set
# default:
CONFIG_LIBC_ASSERT_BUFFER_SIZE=200
# end of LibC

#
# ESP-MM: Memory Management Configurations
#
# default:
# CONFIG_ESP_MM_CACHE_MSYNC_C2M_CHUNKED_OPS is not set
# end of ESP-MM: Memory Management Configurations

#
# ESP NETIF Adapter
#
# default:
CONFIG_ESP_NETIF_LOST_IP_TIMER_ENABLE=y
# default:
CONFIG_ESP_NETIF_IP_LOST_TIMER_INTERVAL=120
# default:
# CONFIG_ESP_NETIF_PROVIDE_CUSTOM_IMPLEMENTATION is not set
# default:
CONFIG_ESP_NETIF_TCPIP_LWIP=y
# default:
# CONFIG_ESP_NETIF_LOOPBACK is not set
# default:
CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API=y
# default:
CONFIG_ESP_NETIF_REPORT_DATA_TRAFFIC=y
# default:
CONFIG_ESP_NETIF_RECEIVE_REPORT_ERRORS=y
# default:
# CONFIG_ESP_NETIF_L2_TAP is not set
# default:
# CONFIG_ESP_NETIF_BRIDGE_EN is not set
# default:
# CONFIG_ESP_NETIF_SET_DNS_PER_DEFAULT_NETIF is not set
# end of ESP NETIF Adapter

#
# Partition API Configuration
#
# end of Partition API Configuration

#
# PHY
#
# default:
CONFIG_ESP_PHY_ENABLED=y
# default:
CONFIG_ESP_PHY_CALIBRATION_AND_DATA_STORAGE=y
# default:
# CONFIG_ESP_PHY_INIT_DATA_IN_PARTITION is not set
# default:
CONFIG_ESP_PHY_MAX_WIFI_TX_POWER=20
# default:
CONFIG_ESP_PHY_MAX_TX_POWER=20
# default:
# CONFIG_ESP_PHY_REDUCE_TX_POWER is not set
# default:
# CONFIG_ESP_PHY_ENABLE_CERT_TEST is not set
# default:
CONFIG_ESP_PHY_RF_CAL_PARTIAL=y
# default:
# CONFIG_ESP_PHY_RF_CAL_NONE is not set
# default:
# CONFIG_ESP_PHY_RF_CAL_FULL is not set
# default:
CONFIG_ESP_PHY_CALIBRATION_MODE=0
# default:
CONFIG_ESP_PHY_PLL_TRACK_PERIOD_MS=1000
# default:
# CONFIG_ESP_PHY_PLL_TRACK_DEBUG is not set
# default:
# CONFIG_ESP_PHY_RECORD_USED_TIME is not set
# default:
CONFIG_ESP_PHY_IRAM_OPT=y
# default:
# CONFIG_ESP_PHY_DEBUG is not set
# default:
CONFIG_ESP_PHY_ENABLE_VERSION_PRINT=y
# end of PHY

#
# Power Management
#
# default:
# CONFIG_PM_SLEEP_FUNC_IN_IRAM is not set
# default:
# CONFIG_PM_ENABLE is not set
# default:
# CONFIG_PM_SLP_IRAM_OPT is not set
# end of Power Management

#
# ESP PSRAM
#
# default:
# CONFIG_SPIRAM is not set
# end of ESP PSRAM

#
# ESP Ringbuf
#
# default:
# CONFIG_RINGBUF_IN_IRAM is not set
# default:
# CONFIG_RINGBUF_PLACE_ISR_FUNCTIONS_INTO_FLASH is not set
# end of ESP Ringbuf

#
# ESP-ROM
#
# default:
CONFIG_ESP_ROM_PRINT_IN_IRAM=y
# end of ESP-ROM

#
# ESP Security Specific
#
# end of ESP Security Specific

#
# ESP-STDIO
#
# default:
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
# default:
# CONFIG_ESP_CONSOLE_USB_CDC is not set
# default:
# CONFIG_ESP_CONSOLE_UART_CUSTOM is not set
# default:
# CONFIG_ESP_CONSOLE_NONE is not set
# default:
CONFIG_ESP_CONSOLE_UART=y
# default:
CONFIG_ESP_CONSOLE_UART_NUM=0
# default:
CONFIG_ESP_CONSOLE_ROM_SERIAL_PORT_NUM=0
# default:
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
# end of ESP-STDIO

#
# ESP System Settings
#
# default:
# CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_80 is not set
# default:
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y
# default:
# CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240 is not set
# default:
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=160

#
# Cache config
#
# default:
CONFIG_ESP32S2_INSTRUCTION_CACHE_8KB=y
# default:
# CONFIG_ESP32S2_INSTRUCTION_CACHE_16KB is not set
# default:
CONFIG_ESP32S2_INSTRUCTION_CACHE_SIZE=0x2000
# default:
# CONFIG_ESP32S2_INSTRUCTION_CACHE_LINE_16B is not set
# default:
CONFIG_ESP32S2_INSTRUCTION_CACHE_LINE_32B=y
# default:
# CONFIG_ESP32S2_DATA_CACHE_0KB is not set
# default:
CONFIG_ESP32S2_DATA_CACHE_8KB=y
# default:
# CONFIG_ESP32S2_DATA_CACHE_16KB is not set
# default:
CONFIG_ESP32S2_DATA_CACHE_SIZE=0x2000
# default:
# CONFIG_ESP32S2_DATA_CACHE_LINE_16B is not set
# default:
CONFIG_ESP32S2_DATA_CACHE_LINE_32B=y
# default:
# CONFIG_ESP32S2_INSTRUCTION_CACHE_WRAP is not set
# default:
# CONFIG_ESP32S2_DATA_CACHE_WRAP is not set
# end of Cache config

#
# Memory
#
# default:
# CONFIG_ESP32S2_RTCDATA_IN_FAST_MEM is not set
# default:
# CONFIG_ESP32S2_USE_FIXED_STATIC_RAM_SIZE is not set
# end of Memory

#
# Trace memory
#
# default:
# CONFIG_ESP32S2_TRAX is not set
# default:
CONFIG_ESP32S2_TRACEMEM_RESERVE_DRAM=0x0
# end of Trace memory

# default:
CONFIG_ESP_SYSTEM_IN_IRAM=y
# default:
# CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT is not set
# default:
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
# default:
# CONFIG_ESP_SYSTEM_PANIC_SILENT_REBOOT is not set
# default:
CONFIG_ESP_SYSTEM_PANIC_REBOOT_DELAY_SECONDS=0
# default:
CONFIG_ESP_SYSTEM_SINGLE_CORE_MODE=y
# default:
CONFIG_ESP_SYSTEM_RTC_FAST_MEM_AS_HEAP_DEPCHECK=y
# default:
CONFIG_ESP_SYSTEM_ALLOW_RTC_FAST_MEM_AS_HEAP=y
# default:
CONFIG_ESP_SYSTEM_MEMPROT=y
# default:
CONFIG_ESP_SYSTEM_MEMPROT_PMS=y
# default:
CONFIG_ESP_SYSTEM_MEMPROT_PMS_LOCK=y
# default:
CONFIG_ESP_SYSTEM_EVENT_QUEUE_SIZE=32
# default:
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=2304
# default:
CONFIG_ESP_MAIN_TASK_STACK_SIZE=3584
# default:
CONFIG_ESP_MAIN_TASK_AFFINITY_CPU0=y
# default:
# CONFIG_ESP_MAIN_TASK_AFFINITY_NO_AFFINITY is not set
# default:
CONFIG_ESP_MAIN_TASK_AFFINITY=0x0
# default:
CONFIG_ESP_MINIMAL_SHARED_STACK_SIZE=2048
# default:
CONFIG_ESP_INT_WDT=y
# default:
CONFIG_ESP_INT_WDT_TIMEOUT_MS=300
# default:
CONFIG_ESP_TASK_WDT_EN=y
# default:
CONFIG_ESP_TASK_WDT_INIT=y
# default:
# CONFIG_ESP_TASK_WDT_PANIC is not set
# default:
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
# default:
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
# default:
# CONFIG_ESP_PANIC_HANDLER_IRAM is not set
# default:
# CONFIG_ESP_DEBUG_STUBS_ENABLE is not set
# default:
CONFIG_ESP_DEBUG_OCDAWARE=y
# default:
CONFIG_ESP_SYSTEM_CHECK_INT_LEVEL_4=y
# default:
# CONFIG_ESP32S2_KEEP_USB_ALIVE is not set
# end of ESP System Settings

#
# IPC (Inter-Processor Call)
#
# default:
CONFIG_ESP_IPC_TASK_STACK_SIZE=1024
# end of IPC (Inter-Processor Call)

#
# ESP Timer (High Resolution Timer)
#
# default:
CONFIG_ESP_TIMER_IN_IRAM=y
# default:
# CONFIG_ESP_TIMER_PROFILING is not set
# default:
CONFIG_ESP_TIME_FUNCS_USE_RTC_TIMER=y
# default:
CONFIG_ESP_TIME_FUNCS_USE_ESP_TIMER=y
# default:
CONFIG_ESP_TIMER_TASK_STACK_SIZE=3584
# default:
CONFIG_ESP_TIMER_INTERRUPT_LEVEL=1
# default:
# CONFIG_ESP_TIMER_SHOW_EXPERIMENTAL is not set
# default:
CONFIG_ESP_TIMER_TASK_AFFINITY=0x0
# default:
CONFIG_ESP_TIMER_TASK_AFFINITY_CPU0=y
# default:
CONFIG_ESP_TIMER_ISR_AFFINITY_CPU0=y
# default:
# CONFIG_ESP_TIMER_SUPPORTS_ISR_DISPATCH_METHOD is not set
# default:
CONFIG_ESP_TIMER_IMPL_SYSTIMER=y
# end of ESP Timer (High Resolution Timer)

