fedddot/esp32_wifi2iic/sdkconfig.defaults
#
# Wi-Fi
#
# default:
CONFIG_ESP_WIFI_ENABLED=y
# default:
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
# default:
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
# default:
# CONFIG_ESP_WIFI_STATIC_TX_BUFFER is not set
# default:
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER=y
# default:
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
# default:
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
# default:
CONFIG_ESP_WIFI_STATIC_RX_MGMT_BUFFER=y
# default:
# CONFIG_ESP_WIFI_DYNAMIC_RX_MGMT_BUFFER is not set
# default:
CONFIG_ESP_WIFI_DYNAMIC_RX_MGMT_BUF=0
# default:
CONFIG_ESP_WIFI_RX_MGMT_BUF_NUM_DEF=5
# default:
# CONFIG_ESP_WIFI_CSI_ENABLED is not set
# default:
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
# default:
CONFIG_ESP_WIFI_TX_BA_WIN=6
# default:
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
# default:
CONFIG_ESP_WIFI_RX_BA_WIN=6
# default:
CONFIG_ESP_WIFI_NVS_ENABLED=y
# default:
CONFIG_ESP_WIFI_SOFTAP_BEACON_MAX_LEN=752
# default:
CONFIG_ESP_WIFI_MGMT_SBUF_NUM=32
# default:
CONFIG_ESP_WIFI_IRAM_OPT=y
# default:
# CONFIG_ESP_WIFI_EXTRA_IRAM_OPT is not set
# default:
CONFIG_ESP_WIFI_RX_IRAM_OPT=y
# default:
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=y
# default:
CONFIG_ESP_WIFI_ENABLE_SAE_H2E=y
# default:
CONFIG_ESP_WIFI_ENABLE_SAE_PK=y
# default:
CONFIG_ESP_WIFI_SOFTAP_SAE_SUPPORT=y
# default:
CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_STA=y
# default:
CONFIG_ESP_WIFI_WPA3_COMPATIBLE_SUPPORT=y
# default:
# CONFIG_ESP_WIFI_SLP_IRAM_OPT is not set
# default:
CONFIG_ESP_WIFI_SLP_DEFAULT_MIN_ACTIVE_TIME=50
# default:
# CONFIG_ESP_WIFI_BSS_MAX_IDLE_SUPPORT is not set
# default:
CONFIG_ESP_WIFI_SLP_DEFAULT_MAX_ACTIVE_TIME=10
# default:
CONFIG_ESP_WIFI_SLP_DEFAULT_WAIT_BROADCAST_DATA_TIME=15
# default:
# CONFIG_ESP_WIFI_FTM_ENABLE is not set
# default:
CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE=y
# default:
CONFIG_ESP_WIFI_GMAC_SUPPORT=y
# default:
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
# default:
# CONFIG_ESP_WIFI_SLP_BEACON_LOST_OPT is not set
# default:
CONFIG_ESP_WIFI_ESPNOW_MAX_ENCRYPT_NUM=7
# default:
# CONFIG_ESP_WIFI_NAN_SYNC_ENABLE is not set
# default:
CONFIG_ESP_WIFI_MBEDTLS_CRYPTO=y
# default:
CONFIG_ESP_WIFI_MBEDTLS_TLS_CLIENT=y
# default:
# CONFIG_ESP_WIFI_WAPI_PSK is not set
# default:
# CONFIG_ESP_WIFI_11KV_SUPPORT is not set
# default:
# CONFIG_ESP_WIFI_MBO_SUPPORT is not set
# default:
# CONFIG_ESP_WIFI_DPP_SUPPORT is not set
# default:
# CONFIG_ESP_WIFI_11R_SUPPORT is not set
# default:
# CONFIG_ESP_WIFI_WPS_SOFTAP_REGISTRAR is not set

#
# WPS Configuration Options
#
# default:
# CONFIG_ESP_WIFI_WPS_STRICT is not set
# default:
# CONFIG_ESP_WIFI_WPS_PASSPHRASE is not set
# default:
# CONFIG_ESP_WIFI_WPS_RECONNECT_ON_FAIL is not set
# end of WPS Configuration Options

# default:
# CONFIG_ESP_WIFI_DEBUG_PRINT is not set
# default:
CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT=y
# default:
# CONFIG_ESP_WIFI_ENT_FREE_DYNAMIC_BUFFER is not set
# default:
# CONFIG_ESP_WIFI_PASSIVE_HIDDEN_AP_SUPPORT is not set
# end of Wi-Fi

#
# Wi-Fi Remote
#
# default:
CONFIG_ESP_WIFI_REMOTE_IN_IDF=y
# default:
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
# default:
CONFIG_SLAVE_IDF_TARGET_ESP32=y
# default:
# CONFIG_SLAVE_IDF_TARGET_ESP32S2 is not set
# default:
# CONFIG_SLAVE_IDF_TARGET_ESP32C3 is not set
# default:
# CONFIG_SLAVE_IDF_TARGET_ESP32S3 is not set
# default:
# CONFIG_SLAVE_IDF_TARGET_ESP32C2 is not set
# default:
# CONFIG_SLAVE_IDF_TARGET_ESP32C6 is not set
# default:
# CONFIG_SLAVE_IDF_TARGET_ESP32C5 is not set
# default:
# CONFIG_SLAVE_IDF_TARGET_ESP32C61 is not set
# default:
# CONFIG_SLAVE_IDF_TARGET_ESP32S31 is not set
# default:
CONFIG_SLAVE_SOC_WIFI_SUPPORTED=y
# default:
CONFIG_SLAVE_SOC_WIFI_WAPI_SUPPORT=y
# default:
CONFIG_SLAVE_SOC_WIFI_CSI_SUPPORT=y
# default:
CONFIG_SLAVE_SOC_WIFI_MESH_SUPPORT=y
# default:
CONFIG_SLAVE_SOC_WIFI_SUPPORT_VARIABLE_BEACON_WINDOW=y
# default:
CONFIG_SLAVE_SOC_WIFI_NAN_SUPPORT=y
# default:
CONFIG_SLAVE_IDF_TARGET_ARCH_XTENSA=y

#
# Wi-Fi configuration
#
# default:
CONFIG_WIFI_RMT_STATIC_RX_BUFFER_NUM=10
# default:
CONFIG_WIFI_RMT_DYNAMIC_RX_BUFFER_NUM=32
# default:
# CONFIG_WIFI_RMT_STATIC_TX_BUFFER is not set
# default:
CONFIG_WIFI_RMT_DYNAMIC_TX_BUFFER=y
# default:
CONFIG_WIFI_RMT_TX_BUFFER_TYPE=1
# default:
CONFIG_WIFI_RMT_DYNAMIC_TX_BUFFER_NUM=32
# default:
CONFIG_WIFI_RMT_STATIC_RX_MGMT_BUFFER=y
# default:
# CONFIG_WIFI_RMT_DYNAMIC_RX_MGMT_BUFFER is not set
# default:
CONFIG_WIFI_RMT_DYNAMIC_RX_MGMT_BUF=0
# default:
CONFIG_WIFI_RMT_RX_MGMT_BUF_NUM_DEF=5
# default:
# CONFIG_WIFI_RMT_CSI_ENABLED is not set
# default:
CONFIG_WIFI_RMT_AMPDU_TX_ENABLED=y
# default:
CONFIG_WIFI_RMT_TX_BA_WIN=6
# default:
CONFIG_WIFI_RMT_AMPDU_RX_ENABLED=y
# default:
CONFIG_WIFI_RMT_RX_BA_WIN=6
# default:
CONFIG_WIFI_RMT_NVS_ENABLED=y
# default:
CONFIG_WIFI_RMT_TASK_PINNED_TO_CORE_0=y
# default:
# CONFIG_WIFI_RMT_TASK_PINNED_TO_CORE_1 is not set
# default:
CONFIG_WIFI_RMT_SOFTAP_BEACON_MAX_LEN=752
# default:
CONFIG_WIFI_RMT_MGMT_SBUF_NUM=32
# default:
CONFIG_WIFI_RMT_IRAM_OPT=y
# default:
# CONFIG_WIFI_RMT_EXTRA_IRAM_OPT is not set
# default:
CONFIG_WIFI_RMT_RX_IRAM_OPT=y
# default:
CONFIG_WIFI_RMT_ENABLE_WPA3_SAE=y
# default:
CONFIG_WIFI_RMT_ENABLE_SAE_H2E=y
# default:
CONFIG_WIFI_RMT_ENABLE_SAE_PK=y
# default:
CONFIG_WIFI_RMT_SOFTAP_SAE_SUPPORT=y
# default:
CONFIG_WIFI_RMT_ENABLE_WPA3_OWE_STA=y
# default:
CONFIG_WIFI_RMT_WPA3_COMPATIBLE_SUPPORT=y
# default:
# CONFIG_WIFI_RMT_SLP_IRAM_OPT is not set
# default:
CONFIG_WIFI_RMT_SLP_DEFAULT_MIN_ACTIVE_TIME=50
# default:
# CONFIG_WIFI_RMT_BSS_MAX_IDLE_SUPPORT is not set
# default:
CONFIG_WIFI_RMT_SLP_DEFAULT_MAX_ACTIVE_TIME=10
# default:
CONFIG_WIFI_RMT_SLP_DEFAULT_WAIT_BROADCAST_DATA_TIME=15
# default:
CONFIG_WIFI_RMT_STA_DISCONNECTED_PM_ENABLE=y
# default:
CONFIG_WIFI_RMT_GMAC_SUPPORT=y
# default:
CONFIG_WIFI_RMT_SOFTAP_SUPPORT=y
# default:
# CONFIG_WIFI_RMT_SLP_BEACON_LOST_OPT is not set
# default:
CONFIG_WIFI_RMT_ESPNOW_MAX_ENCRYPT_NUM=7
# default:
# CONFIG_WIFI_RMT_NAN_SYNC_ENABLE is not set
# default:
CONFIG_WIFI_RMT_MBEDTLS_CRYPTO=y
# default:
CONFIG_WIFI_RMT_MBEDTLS_TLS_CLIENT=y
# default:
# CONFIG_WIFI_RMT_WAPI_PSK is not set
# default:
# CONFIG_WIFI_RMT_11KV_SUPPORT is not set
# default:
# CONFIG_WIFI_RMT_MBO_SUPPORT is not set
# default:
# CONFIG_WIFI_RMT_DPP_SUPPORT is not set
# default:
# CONFIG_WIFI_RMT_11R_SUPPORT is not set
# default:
# CONFIG_WIFI_RMT_WPS_SOFTAP_REGISTRAR is not set

#
# WPS Configuration Options
#
# default:
# CONFIG_WIFI_RMT_WPS_STRICT is not set
# default:
# CONFIG_WIFI_RMT_WPS_PASSPHRASE is not set
# default:
# CONFIG_WIFI_RMT_WPS_RECONNECT_ON_FAIL is not set
# end of WPS Configuration Options

# default:
# CONFIG_WIFI_RMT_DEBUG_PRINT is not set
# default:
CONFIG_WIFI_RMT_ENTERPRISE_SUPPORT=y
# default:
# CONFIG_WIFI_RMT_ENT_FREE_DYNAMIC_BUFFER is not set
# default:
# CONFIG_WIFI_RMT_PASSIVE_HIDDEN_AP_SUPPORT is not set
# end of Wi-Fi configuration

# default:
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
# default:
# CONFIG_ESP_WIFI_REMOTE_LIBRARY_EPPP is not set
# default:
# CONFIG_ESP_WIFI_REMOTE_LIBRARY_CUSTOM is not set
# default:
CONFIG_ESP_WIFI_REMOTE_EAP_ENABLED=y
# end of Wi-Fi Remote

#
# FreeRTOS
#

#
# Kernel
#
# default:
CONFIG_FREERTOS_UNICORE=y
# default:
CONFIG_FREERTOS_HZ=100
# default:
CONFIG_FREERTOS_OPTIMIZED_SCHEDULER=y
# default:
# CONFIG_FREERTOS_CHECK_STACKOVERFLOW_NONE is not set
# default:
# CONFIG_FREERTOS_CHECK_STACKOVERFLOW_PTRVAL is not set
# default:
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y
# default:
CONFIG_FREERTOS_THREAD_LOCAL_STORAGE_POINTERS=1
# default:
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=1536
# default:
# CONFIG_FREERTOS_USE_IDLE_HOOK is not set
# default:
# CONFIG_FREERTOS_USE_TICK_HOOK is not set
# default:
CONFIG_FREERTOS_MAX_TASK_NAME_LEN=16
# default:
# CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY is not set
# default:
CONFIG_FREERTOS_USE_TIMERS=y
# default:
CONFIG_FREERTOS_TIMER_SERVICE_TASK_NAME="Tmr Svc"
# default:
# CONFIG_FREERTOS_TIMER_TASK_AFFINITY_CPU0 is not set
# default:
CONFIG_FREERTOS_TIMER_TASK_NO_AFFINITY=y
# default:
CONFIG_FREERTOS_TIMER_SERVICE_TASK_CORE_AFFINITY=0x7FFFFFFF
# default:
CONFIG_FREERTOS_TIMER_TASK_PRIORITY=1
# default:
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=2048
# default:
CONFIG_FREERTOS_TIMER_QUEUE_LENGTH=10
# default:
CONFIG_FREERTOS_QUEUE_REGISTRY_SIZE=0
# default:
CONFIG_FREERTOS_TASK_NOTIFICATION_ARRAY_ENTRIES=1
# default:
# CONFIG_FREERTOS_USE_TRACE_FACILITY is not set
# default:
# CONFIG_FREERTOS_USE_LIST_DATA_INTEGRITY_CHECK_BYTES is not set
# default:
# CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS is not set
# default:
# CONFIG_FREERTOS_USE_APPLICATION_TASK_TAG is not set
# end of Kernel

#
# Port
#
# default:
CONFIG_FREERTOS_TASK_FUNCTION_WRAPPER=y
# default:
# CONFIG_FREERTOS_WATCHPOINT_END_OF_STACK is not set
# default:
CONFIG_FREERTOS_TLSP_DELETION_CALLBACKS=y
# default:
# CONFIG_FREERTOS_TASK_PRE_DELETION_HOOK is not set
# default:
CONFIG_FREERTOS_CHECK_MUTEX_GIVEN_BY_OWNER=y
# default:
CONFIG_FREERTOS_ISR_STACKSIZE=1536
# default:
CONFIG_FREERTOS_INTERRUPT_BACKTRACE=y
# default:
CONFIG_FREERTOS_TICK_SUPPORT_CORETIMER=y
# default:
CONFIG_FREERTOS_CORETIMER_0=y
# default:
# CONFIG_FREERTOS_CORETIMER_1 is not set
# default:
CONFIG_FREERTOS_SYSTICK_USES_CCOUNT=y
# default:
# CONFIG_FREERTOS_IN_IRAM is not set
# default:
# CONFIG_FREERTOS_CHECK_PORT_CRITICAL_COMPLIANCE is not set
# end of Port

#
# Extra
#
# end of Extra

# default:
CONFIG_FREERTOS_PORT=y
# default:
CONFIG_FREERTOS_NO_AFFINITY=0x7FFFFFFF
# default:
CONFIG_FREERTOS_SUPPORT_STATIC_ALLOCATION=y
# default:
CONFIG_FREERTOS_DEBUG_OCDAWARE=y
# default:
CONFIG_FREERTOS_NUMBER_OF_CORES=1
# end of FreeRTOS

#
# Hardware Abstraction Layer (HAL) and Low Level (LL)
#
# default:
CONFIG_HAL_ASSERTION_EQUALS_SYSTEM=y
# default:
# CONFIG_HAL_ASSERTION_DISABLE is not set
# default:
# CONFIG_HAL_ASSERTION_SILENT is not set
# default:
# CONFIG_HAL_ASSERTION_ENABLE is not set
# default:
CONFIG_HAL_DEFAULT_ASSERTION_LEVEL=2
# default:
CONFIG_HAL_GPIO_USE_ROM_IMPL=y
# end of Hardware Abstraction Layer (HAL) and Low Level (LL)

#
# Heap memory debugging
#
# default:
CONFIG_HEAP_POISONING_DISABLED=y
# default:
# CONFIG_HEAP_POISONING_LIGHT is not set
# default:
# CONFIG_HEAP_POISONING_COMPREHENSIVE is not set
# default:
CONFIG_HEAP_TRACING_OFF=y
# default:
# CONFIG_HEAP_TRACING_STANDALONE is not set
# default:
# CONFIG_HEAP_TRACING_TOHOST is not set
# default:
# CONFIG_HEAP_USE_HOOKS is not set
# default:
# CONFIG_HEAP_TASK_TRACKING is not set
# default:
# CONFIG_HEAP_ABORT_WHEN_ALLOCATION_FAILS is not set
# default:
# CONFIG_HEAP_PLACE_FUNCTION_INTO_FLASH is not set
# end of Heap memory debugging

#
# Log
#
# default:
CONFIG_LOG_VERSION_1=y
# default:
# CONFIG_LOG_VERSION_2 is not set
# default:
CONFIG_LOG_VERSION=1

#
# Log Level
#
# default:
# CONFIG_LOG_DEFAULT_LEVEL_NONE is not set
# default:
# CONFIG_LOG_DEFAULT_LEVEL_ERROR is not set
# default:
# CONFIG_LOG_DEFAULT_LEVEL_WARN is not set
# default:
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
# default:
# CONFIG_LOG_DEFAULT_LEVEL_DEBUG is not set
# default:
# CONFIG_LOG_DEFAULT_LEVEL_VERBOSE is not set
# default:
CONFIG_LOG_DEFAULT_LEVEL=3
# default:
CONFIG_LOG_MAXIMUM_EQUALS_DEFAULT=y
# default:
# CONFIG_LOG_MAXIMUM_LEVEL_DEBUG is not set
# default:
# CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE is not set
# default:
CONFIG_LOG_MAXIMUM_LEVEL=3

#
# Level Settings
#
# default:
# CONFIG_LOG_MASTER_LEVEL is not set
# default:
CONFIG_LOG_DYNAMIC_LEVEL_CONTROL=y
# default:
# CONFIG_LOG_TAG_LEVEL_IMPL_NONE is not set
# default:
# CONFIG_LOG_TAG_LEVEL_IMPL_LINKED_LIST is not set
# default:
CONFIG_LOG_TAG_LEVEL_IMPL_CACHE_AND_LINKED_LIST=y
# default:
# CONFIG_LOG_TAG_LEVEL_CACHE_ARRAY is not set
# default:
CONFIG_LOG_TAG_LEVEL_CACHE_BINARY_MIN_HEAP=y
# default:
CONFIG_LOG_TAG_LEVEL_IMPL_CACHE_SIZE=31
# end of Level Settings
# end of Log Level

#
# Format
#
# default:
# CONFIG_LOG_COLORS is not set
# default:
CONFIG_LOG_TIMESTAMP_SOURCE_RTOS=y
# default:
# CONFIG_LOG_TIMESTAMP_SOURCE_SYSTEM is not set
# end of Format

#
# Settings
#
# default:
CONFIG_LOG_MODE_TEXT_EN=y
# default:
CONFIG_LOG_MODE_TEXT=y
# end of Settings

# default:
CONFIG_LOG_IN_IRAM=y
# end of Log

#
# LWIP
#
# default:
CONFIG_LWIP_ENABLE=y
# default:
CONFIG_LWIP_LOCAL_HOSTNAME="espressif"
# default:
CONFIG_LWIP_TCPIP_TASK_PRIO=18
# default:
# CONFIG_LWIP_TCPIP_CORE_LOCKING is not set
# default:
# CONFIG_LWIP_CHECK_THREAD_SAFETY is not set
# default:
CONFIG_LWIP_DNS_SUPPORT_MDNS_QUERIES=y
# default:
# CONFIG_LWIP_L2_TO_L3_COPY is not set
# default:
# CONFIG_LWIP_IRAM_OPTIMIZATION is not set
# default:
# CONFIG_LWIP_EXTRA_IRAM_OPTIMIZATION is not set
# default:
CONFIG_LWIP_TIMERS_ONDEMAND=y
# default:
CONFIG_LWIP_ND6=y
# default:
# CONFIG_LWIP_FORCE_ROUTER_FORWARDING is not set
# default:
CONFIG_LWIP_MAX_SOCKETS=10
# default:
# CONFIG_LWIP_USE_ONLY_LWIP_SELECT is not set
# default:
# CONFIG_LWIP_SO_LINGER is not set
# default:
CONFIG_LWIP_SO_REUSE=y
# default:
CONFIG_LWIP_SO_REUSE_RXTOALL=y
# default:
# CONFIG_LWIP_SO_RCVBUF is not set
# default:
# CONFIG_LWIP_NETBUF_RECVINFO is not set
# default:
CONFIG_LWIP_IP_DEFAULT_TTL=64
# default:
CONFIG_LWIP_IP4_FRAG=y
# default:
CONFIG_LWIP_IP6_FRAG=y
# default:
# CONFIG_LWIP_IP4_REASSEMBLY is not set
# default:
# CONFIG_LWIP_IP6_REASSEMBLY is not set
# default:
CONFIG_LWIP_IP_REASS_MAX_PBUFS=10
# default:
CONFIG_LWIP_IPV6_DUP_DETECT_ATTEMPTS=1
# default:
# CONFIG_LWIP_IP_FORWARD is not set
# default:
# CONFIG_LWIP_STATS is not set
# default:
CONFIG_LWIP_ESP_GRATUITOUS_ARP=y
# default:
CONFIG_LWIP_GARP_TMR_INTERVAL=60
# default:
CONFIG_LWIP_ESP_MLDV6_REPORT=y
# default:
CONFIG_LWIP_MLDV6_TMR_INTERVAL=40
# default:
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=32
# default:
CONFIG_LWIP_DHCP_DOES_ARP_CHECK=y
# default:
# CONFIG_LWIP_DHCP_DOES_ACD_CHECK is not set
# default:
# CONFIG_LWIP_DHCP_DOES_NOT_CHECK_OFFERED_IP is not set
# default:
# CONFIG_LWIP_DHCP_DISABLE_CLIENT_ID is not set
# default:
CONFIG_LWIP_DHCP_DISABLE_VENDOR_CLASS_ID=y
# default:
# CONFIG_LWIP_DHCP_RESTORE_LAST_IP is not set
# default:
CONFIG_LWIP_DHCP_OPTIONS_LEN=69
# default:
CONFIG_LWIP_NUM_NETIF_CLIENT_DATA=0
# default:
CONFIG_LWIP_DHCP_COARSE_TIMER_SECS=1

#
# DHCP server
#
# default:
CONFIG_LWIP_DHCPS=y
# default:
CONFIG_LWIP_DHCPS_REPORT_CLIENT_HOSTNAME=y
# default:
CONFIG_LWIP_DHCPS_LEASE_UNIT=60
# default:
CONFIG_LWIP_DHCPS_MAX_STATION_NUM=8
# default:
CONFIG_LWIP_DHCPS_MAX_HOSTNAME_LEN=64
# default:
CONFIG_LWIP_DHCPS_STATIC_ENTRIES=y
# default:
# CONFIG_LWIP_DHCPS_TEST_PARSE_OPTIONS is not set
# end of DHCP server

# default:
# CONFIG_LWIP_AUTOIP is not set
# default:
CONFIG_LWIP_IPV4=y
# default:
CONFIG_LWIP_IPV6=y
# default:
# CONFIG_LWIP_IPV6_AUTOCONFIG is not set
# default:
CONFIG_LWIP_IPV6_NUM_ADDRESSES=3
# default:
# CONFIG_LWIP_IPV6_FORWARD is not set
# default:
# CONFIG_LWIP_NETIF_STATUS_CALLBACK is not set
# default:
# CONFIG_LWIP_NETIF_LINK_CALLBACK is not set
# default:
CONFIG_LWIP_NETIF_LOOPBACK=y
# default:
CONFIG_LWIP_LOOPBACK_MAX_PBUFS=8

#
# TCP
#
# default:
CONFIG_LWIP_MAX_ACTIVE_TCP=16
# default:
CONFIG_LWIP_MAX_LISTENING_TCP=16
# default:
CONFIG_LWIP_TCP_HIGH_SPEED_RETRANSMISSION=y
# default:
CONFIG_LWIP_TCP_MAXRTX=12
# default:
CONFIG_LWIP_TCP_SYNMAXRTX=12
# default:
CONFIG_LWIP_TCP_MSS=1440
# default:
CONFIG_LWIP_TCP_TMR_INTERVAL=250
# default:
CONFIG_LWIP_TCP_MSL=60000
# default:
CONFIG_LWIP_TCP_FIN_WAIT_TIMEOUT=20000
# default:
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=5760
# default:
CONFIG_LWIP_TCP_WND_DEFAULT=5760
# default:
CONFIG_LWIP_TCP_RECVMBOX_SIZE=6
# default:
CONFIG_LWIP_TCP_ACCEPTMBOX_SIZE=6
# default:
CONFIG_LWIP_TCP_QUEUE_OOSEQ=y
# default:
CONFIG_LWIP_TCP_OOSEQ_TIMEOUT=6
# default:
CONFIG_LWIP_TCP_OOSEQ_MAX_PBUFS=4
# default:
# CONFIG_LWIP_TCP_SACK_OUT is not set
# default:
CONFIG_LWIP_TCP_OVERSIZE_MSS=y
# default:
# CONFIG_LWIP_TCP_OVERSIZE_QUARTER_MSS is not set
# default:
# CONFIG_LWIP_TCP_OVERSIZE_DISABLE is not set
# default:
CONFIG_LWIP_TCP_RTO_TIME=1500
# end of TCP

#
# UDP
#
# default:
CONFIG_LWIP_MAX_UDP_PCBS=16
# default:
CONFIG_LWIP_UDP_RECVMBOX_SIZE=6
# end of UDP

#
# Checksums
#
# default:
# CONFIG_LWIP_CHECKSUM_CHECK_IP is not set
# default:
# CONFIG_LWIP_CHECKSUM_CHECK_UDP is not set
# default:
CONFIG_LWIP_CHECKSUM_CHECK_ICMP=y
# end of Checksums

# default:
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=3072
# default:
CONFIG_LWIP_TCPIP_TASK_AFFINITY_NO_AFFINITY=y
# default:
# CONFIG_LWIP_TCPIP_TASK_AFFINITY_CPU0 is not set
# default:
CONFIG_LWIP_TCPIP_TASK_AFFINITY=0x7FFFFFFF
# default:
CONFIG_LWIP_IPV6_MEMP_NUM_ND6_QUEUE=3
# default:
CONFIG_LWIP_IPV6_ND6_NUM_NEIGHBORS=5
# default:
CONFIG_LWIP_IPV6_ND6_NUM_PREFIXES=5
# default:
CONFIG_LWIP_IPV6_ND6_NUM_ROUTERS=3
# default:
CONFIG_LWIP_IPV6_ND6_NUM_DESTINATIONS=10
# default:
# CONFIG_LWIP_IPV6_ND6_ROUTE_INFO_OPTION_SUPPORT is not set
# default:
# CONFIG_LWIP_PPP_SUPPORT is not set
# default:
# CONFIG_LWIP_SLIP_SUPPORT is not set

#
# ICMP
#
# default:
CONFIG_LWIP_ICMP=y
# default:
# CONFIG_LWIP_MULTICAST_PING is not set
# default:
# CONFIG_LWIP_BROADCAST_PING is not set
# end of ICMP

#
# LWIP RAW API
#
# default:
CONFIG_LWIP_MAX_RAW_PCBS=16
# end of LWIP RAW API

#
# SNTP
#
# default:
CONFIG_LWIP_SNTP_MAX_SERVERS=1
# default:
# CONFIG_LWIP_DHCP_GET_NTP_SRV is not set
# default:
CONFIG_LWIP_SNTP_UPDATE_DELAY=3600000
# default:
CONFIG_LWIP_SNTP_STARTUP_DELAY=y
# default:
CONFIG_LWIP_SNTP_MAXIMUM_STARTUP_DELAY=5000
# end of SNTP

#
# DNS
#
# default:
CONFIG_LWIP_DNS_MAX_HOST_IP=1
# default:
CONFIG_LWIP_DNS_MAX_SERVERS=3
# default:
# CONFIG_LWIP_FALLBACK_DNS_SERVER_SUPPORT is not set
# default:
# CONFIG_LWIP_DNS_SETSERVER_WITH_NETIF is not set
# default:
# CONFIG_LWIP_USE_ESP_GETADDRINFO is not set
# end of DNS

# default:
CONFIG_LWIP_BRIDGEIF_MAX_PORTS=7
# default:
CONFIG_LWIP_ESP_LWIP_ASSERT=y

